# Questions and Results

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('quize_pandas.zip', compression='zip')

In [3]:
data.head(5)

   Customer Product Model  Count    Volume
0  CI100019     P03   M01   21.0       NaN
1  CI100028     P01   M02    9.0       NaN
2  CI100019     P01   M02    9.0       NaN
3  CI100019     P02   M03    NaN  1.370358
4  CI100019     P03   M02   61.0       NaN

### 1- با استفاده از دادگان ارائه شده محاسبه کنید هر مشتری چند درصد از هر محصول را خریده است. (با دقت دهگان درصد)

In [4]:
cpm_p_table = pd.pivot_table(data,index='Customer',columns=['Product','Model'],values='Count',aggfunc='sum')

cpm_p_table=cpm_p_table.apply((lambda x:round(x/x.sum()*100)) ,axis=0)

In [5]:
cpm_p_table

Product     P01             P02           P03
Model       M01   M02   M03 M01 M02 M03   M01   M02   M03
Customer
CI100019    NaN  72.0  83.0 NaN NaN NaN  20.0  42.0  55.0
CI100021  100.0   NaN  17.0 NaN NaN NaN  40.0  34.0  45.0
CI100028    NaN  28.0   NaN NaN NaN NaN  39.0  24.0   NaN

### 2- به هر سطر لیست دادگان میزان کل محصول خریداری شده اضافه کنید و بنا به شماره مشتری، محصول و مدل مرتب کنید

# solution

3- دیتای زیر را برای افراد ۱۸ سال و به بالا بر اساس ستون درصدمرتب کرده تا به شکل نهایی نشان داده شده برسد

In [14]:
import pandas as pd

record = {

'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka', 'Priya', 'Shaurya' ],
'Age': [21, 19, 20, 18, 17, 21],
'Stream': ['Math', 'Commerce', 'Science', 'Math', 'Math', 'Science'],
'Percentage': [88, 92, 95, 70, 65, 78] }

# create a dataframe
dataframe = pd.DataFrame(record, columns = ['Name', 'Age', 'Stream', 'Percentage'])

dataframe

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
3   Priyanka   18      Math          70
4      Priya   17      Math          65
5    Shaurya   21   Science          78

In [15]:
dataframe[dataframe['Age']>=18].sort_values('Percentage',ascending=False)

        Name  Age    Stream  Percentage
2  Aishwarya   20   Science          95
1       Amit   19  Commerce          92
0      Ankit   21      Math          88
5    Shaurya   21   Science          78
3   Priyanka   18      Math          70